In [1]:
import pandas as pd 
from sqlalchemy import create_engine

In [6]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/sql_homework')
connection = engine.connect()

In [14]:
salary_data = pd.read_sql('select * from "Salaries"',connection)
titles = pd.read_sql('select * from "Titles"',connection)

In [19]:
titles.head()

   emp_num            title   from_date     to_date
0    10001  Senior Engineer  1986-06-26  9999-01-01
1    10002            Staff  1996-08-03  9999-01-01
2    10003  Senior Engineer  1995-12-03  9999-01-01
3    10004         Engineer  1986-12-01  1995-12-01
4    10004  Senior Engineer  1995-12-01  9999-01-01

In [20]:
titles_salary = titles.merge(salary_data, on=['emp_num'])

In [27]:
avg_salary = titles_salary.groupby('title').agg('mean')

In [28]:
avg_salary.head()

                          emp_num        salary
title
Assistant Engineer  251495.398533  48493.204786
Engineer            252943.159987  48539.781423
Manager             110780.833333  51531.041667
Senior Engineer     253034.375949  48506.751806
Senior Staff        253423.367183  58503.286614